equipment_classes = [
    "보안경", "안전대", "보호복", 
    "마스크", "안전화", "안전장갑", "안전모"
]
equipment_to_disaster = {
    "보안경": ["넘어짐", "부딪힘", "맞음", "절단_베임_찔림", "이상온도_물체접촉", "화학물질노출", "분진"],
    "안전대": ["떨어짐", "빠짐_익사"],
    "보호복": ["깔림", "무너짐", "끼임", "절단_베임_찔림", "감전_폭발_파열", "화재", "무리한 동작", "이상온도_물체접촉", "화학물질노출", "교통사고", "분진"],
    "마스크": ["분진"],
    "안전화": ["떨어짐", "넘어짐", "깔림", "무너짐"],
    "안전장갑": ["끼임", "절단_베임_찔림", "감전_폭발_파열", "화재", "화학물질노출"],
    "안전모": ["떨어짐", "부딪힘", "맞음", "무너짐", "교통사고"]
}
work_tasks = [
    "고소작업",           # 높은 곳에서 작업
    "용접작업",           # 불꽃 발생
    "절단작업",           # 칼, 전기톱
    "전기작업",           # 전선, 패널 등
    "화학물질취급",       # 유해물질
    "분진노출작업",       # 먼지 많은 작업
    "중장비작업",         # 굴착기, 지게차
    "물류하역작업",       # 무거운 짐 옮김
    "침수/수상작업",      # 물에서 작업
    "폭발위험작업",       # 폭발 가능성
]
task_to_equipment = {
    "고소작업": ["안전대", "안전모", "안전화"],
    "용접작업": ["보안경", "보호복", "안전장갑", "안전화"],
    "절단작업": ["보안경", "보호복", "안전장갑", "안전화"],
    "전기작업": ["보안경", "보안경", "보호복", "안전장갑"],
    "화학물질취급": ["마스크", "보호복", "보안경", "안전장갑"],
    "분진노출작업": ["마스크", "보호복", "보안경"],
    "중장비작업": ["안전모", "보호복", "안전화"],
    "물류하역작업": ["보호복", "안전화", "안전장갑"],
    "침수/수상작업": ["안전대", "구명조끼(외부 클래스)", "보호복"],
    "폭발위험작업": ["마스크", "보안경", "보호복", "안전장갑"]
}
